In [30]:
import pandas as pd

In [94]:
data = pd.read_csv('train.csv')
data['date'] = pd.to_datetime(data.date, dayfirst=False)

In [95]:
data = pd.pivot_table(data, index='date', columns=['store', 'item'], values='sales')
#data.columns = ['s{}-i{}'.format(c[0], c[1]) for c in data.columns.values]
y_labels = ['y_{}'.format(i) for i in range(len(data.columns.values))]
data.columns = y_labels
data.reset_index(inplace=True)
data.head()

,date,y_0,y_1,y_2,y_3,y_4,y_5,y_6,y_7,y_8,...,y_490,y_491,y_492,y_493,y_494,y_495,y_496,y_497,y_498,y_499
0,2013-01-01,13,33,15,10,11,31,25,33,18,...,12,20,24,17,45,37,11,25,17,33
1,2013-01-02,11,43,30,11,6,36,23,37,23,...,10,22,29,10,45,33,13,24,13,37
2,2013-01-03,14,23,14,8,8,18,34,38,25,...,17,27,43,20,56,28,16,29,19,46
3,2013-01-04,13,18,10,19,9,19,36,54,22,...,13,24,27,12,50,44,11,39,23,51
4,2013-01-05,10,34,23,12,8,31,38,51,29,...,14,25,31,25,62,45,16,34,22,41

# Categorical variables encoding
one_hot_store = pd.get_dummies(data.store, prefix='store')
one_hot_item = pd.get_dummies(data.item, prefix='item')
data = data.join(one_hot_store)
data = data.join(one_hot_item)
data.drop(columns=['store', 'item'], inplace=True)
data.head()

In [96]:
# date to categorical
data['year'] = data['date'].dt.year
data['month'] = data['date'].dt.month
data['day'] = data['date'].dt.day
data.drop(columns=['date'], inplace=True)

In [97]:
data.head()

,y_0,y_1,y_2,y_3,y_4,y_5,y_6,y_7,y_8,y_9,...,y_493,y_494,y_495,y_496,y_497,y_498,y_499,year,month,day
0,13,33,15,10,11,31,25,33,18,37,...,17,45,37,11,25,17,33,2013,1,1
1,11,43,30,11,6,36,23,37,23,34,...,10,45,33,13,24,13,37,2013,1,2
2,14,23,14,8,8,18,34,38,25,32,...,20,56,28,16,29,19,46,2013,1,3
3,13,18,10,19,9,19,36,54,22,45,...,12,50,44,11,39,23,51,2013,1,4
4,10,34,23,12,8,31,38,51,29,35,...,25,62,45,16,34,22,41,2013,1,5

In [102]:
# n-lookback
n = 1
for y in y_labels:
    data['{}-1'.format(y)] = data[y].shift(1)

In [103]:
data.head()

,y_0,y_1,y_2,y_3,y_4,y_5,y_6,y_7,y_8,y_9,...,y_490-1,y_491-1,y_492-1,y_493-1,y_494-1,y_495-1,y_496-1,y_497-1,y_498-1,y_499-1
0,13,33,15,10,11,31,25,33,18,37,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,11,43,30,11,6,36,23,37,23,34,...,12.0,20.0,24.0,17.0,45.0,37.0,11.0,25.0,17.0,33.0
2,14,23,14,8,8,18,34,38,25,32,...,10.0,22.0,29.0,10.0,45.0,33.0,13.0,24.0,13.0,37.0
3,13,18,10,19,9,19,36,54,22,45,...,17.0,27.0,43.0,20.0,56.0,28.0,16.0,29.0,19.0,46.0
4,10,34,23,12,8,31,38,51,29,35,...,13.0,24.0,27.0,12.0,50.0,44.0,11.0,39.0,23.0,51.0

In [108]:
y = data[y_labels].values
x = data[[x for x in data.columns if x not in y_labels]]

In [112]:
print(x.shape, y.shape)

(1826, 503) (1826, 500)

In [ ]:
# cyclical date features
# normalization